{
  "additionalExperience": {
    "title": "Additional Experience",
    "content": [
      {
        "name": "Freelance Web Developer",
        "title": "Web Developer",
        "location": null,
        "from": "Aug 2011",
        "until": "Jan 2017",
        "description": "Wordpress, EJS, jQuery, CreateJS, Static HTML, Email Templates, Heroku, GA",
        "link": null
      },
      {
        "name": "Acidotic Racing",
        "title": "Web Developer",
        "location": "Seacoast NH",
        "from": "Nov 2013",
        "until": "Dec 2015",
        "description": "Angular, Firebase, Custom CMS",
        "link": "http://www.acidoticracing.com/"
      },
      {
        "name": "PICA Manufacturing Solutions ",
        "title": "Web Developer",
        "location": "Derry, NH",
        "from": "Dec 2012",
        "until": "Dec 2014",
        "description": "Static HTML, Angular, Firebase",
        "link": "https://picamfg.com/"
      },
      {
        "name": "Central Midori",
        "title": "Web Developer",
        "location": null,
        "from": "Sept 2017",
        "until": "Jan 2018",
        "description": "S3, CloudFront, EC2. Static HTML with Gulp and hosted Wordpress for Blog.",
        "link": "https://www.centralmidori.com/"
      },
      {
        "name": "Marilinda Garcia for Congress",
        "title": "Web Developer",
        "location": "New Hampshire",
        "from": "Nov 2013",
        "until": "April 2014",
        "description": "My primary role with this campaign is to create a website where voters have access to latest news, social media links and general campaign information. Other responsibilities include: graphic design, photo editing and logo design.",
        "link": "https://en.wikipedia.org/wiki/Marilinda_Garcia"
      },
      {
        "name": "Startup Institute",
        "title": "Product & Design",
        "location": "Boston, MA",
        "from": "Mar 2014",
        "until": "Apr 2014",
        "description": "Selected by Startup Institute in a highly competitive process to attend an intensive training program focused on developing the core skills in product & design to have a meaningful and positive influence on a startup's objectives. - HTML, CSS, jQuery and Javascript - Product Management - Responsive Design - Organizing a Design Project - User Centered Design & Whiteboarding - Wireframing & Rapid Prototyping - Typography",
        "link": null
      }
    ]
  },
  "references": {
    "title": "Nice things people had to say",
    "content": [
      {
        "name": "Winfield Trail",
        "image": "https://media-exp1.licdn.com/dms/image/C4D03AQGypiSJAZ4tHw/profile-displayphoto-shrink_200_200/0?e=1588204800&v=beta&t=NSMwHjf3v4ZURo5dWKfJ1jHSotPGI8EKGVl1p-TTYDE",
        "link": "https://www.linkedin.com/in/winfield-trail-a9799329/",
        "title": "Lead Programmer, Paint Nite d/b/a Yaymaker, worked with Stephen at Paint Nite",
        "content": "Stephen is one of my most valued colleagues, and nobody can bang out CSS faster or better than him. In his time with PaintNite, Stephen has successfully evangelized technologies like Less, Gulp, and Angular, which alongside his spectacular problem-solving ability have radically improved every aspect of our product. It is my privilege to work with Mr. Young, so much that I can overlook his barbaric preference for soft tab indentation when editing HTML. He is a consummate team player: even though in terms of capability, he is an army of one.",
        "relevant": true
      },
      {
        "name": "Katelyn Friedson",
        "image": "https://media-exp1.licdn.com/dms/image/C4E03AQF5wL91d9VdDw/profile-displayphoto-shrink_200_200/0?e=1588204800&v=beta&t=NUMUJnbShrleFsMsJE2s2JT26c962vudRN3j-7TqT9A",
        "link": "https://www.linkedin.com/in/kfriedson/",
        "title": "Product Manager, worked with Stephen at Paint Nite d/b/a Yaymaker",
        "content": "I have worked with few developers who are as knowledgeable, passionate and effective at creating beautiful and engaging user experiences as Stephen has at Paint Nite. Stephen is not only highly skilled and agile, but he also has excellent people, communication and leadership skills which make him a pleasure to work with, and an invaluable part of any web team. As lead developer at Paint Nite, Stephen not only demonstrates a mastery of web technologies, but also a commanding grasp and deep understanding of business goals and cross-functional initiatives. Stephen has been a key contributor to the success of Paint Nite's 'Next Gen' product launch, and has been a valued and respected member of the organization. On a personal level, Stephen has a great sense of humor, contagious creative energy, and has lots of hidden artistic talents. :)",
        "relevant": true
      },
      {
        "name": "Ryan McDonald",
        "image": "https://media-exp1.licdn.com/dms/image/C4E03AQGl8srY1KmJdQ/profile-displayphoto-shrink_200_200/0?e=1588204800&v=beta&t=c1H7YEH9Hdw2Izrj6-8ne2xhe3CN8i5ELpLGkQRcQos",
        "link": "https://www.linkedin.com/in/rpmcdonald/",
        "title": "Full Stack Developer, Vsnap, worked directly with Stephen at Vsnap",
        "content": "Stephen is a passionate, driven and talented developer. His love for programming is clearly visible in his tireless dedication to a project and his artistic abilities and creativity only add to his effectiveness as a front end web developer. Stephen and I first worked together when he was brought on as an interim-developer at Vsnap while he planned a move from Boston, MA to Austin, TX. He quickly picked up AngularJS (a front end framework that was new to him) and demonstrated so much ambition that he was hired as a full time front end dev despite the fact that he would be moving and have to work remotely. As a member of the Vsnap dev team Stephen was always happy to pick up any task that needed doing and never shy about working on things that were outside of his comfort zone. He as always very helpful if I ever had a question and very open to discussion when deciding the best way to tackle a problem. I would highly recommend Stephen and would love to work with again if the opportunity presented itself.",
        "relevant": true
      },
      {
        "name": "Dave McLaughlin",
        "image": "https://media-exp1.licdn.com/dms/image/C4E03AQElcXREaOzWXw/profile-displayphoto-shrink_200_200/0?e=1588204800&v=beta&t=3zUvQSOG-tWwkTFdPjWMjPJXD9e6cuqvL4gjgdjQ_I0",
        "link": "https://www.linkedin.com/in/davemacboston/",
        "title": "CEO & Co-Founder, Vsnap, managed Stephen indirectly at Vsnap",
        "content": "Stephen is super talented and hard working, and he's also just a wonderful guy and an amazing team member. He has the creative spirit of an artist and the work ethic of a coal miner. Absolutely a guy who amplifies the energy and brings great things to any team. He brought so much to our product at Vsnap, and it's a true pleasure to recommend him.",
        "relevant": true
      },
      {
        "name": "Niksa Janjic",
        "title": "Developer, Vsnap, worked directly with Stephen at Vsnap",
        "content": "Stephen is a talented Frontend developer who also has a keen eye for design. As a developer at Vsnap he worked on a frontend part of the app developing in Angular. He is very fast at delivering new features and rewrote whole HTML/CSS part of the app to optimize it and improve it noticeably. He is capable of making pages from scratch, creating beautiful designs straight from the head. He also wrote lots and refactored most of unit-tests with a coverage over 90%, created bunch of directives to reduce boilerplate code and made sure all pages are responsive and work cross-browser. He usually reviewed my code and gave me ideas and advices how to improve it and made sure it is optimized and minimal as possible."
      },
      {
        "name": "Nathan Levesque",
        "title": "Lead Software Developer, Vsnap, managed Stephen indirectly at Vsnap",
        "content": "Stephen is a strong front end developer who doesn't hesitate to dive in and learn backend services for feature implementation and bug fixes. Recently, Stephen put in a great deal of effort to identify and fix some deficiencies with our Jasmine-based front end tests which enabled the tests to be much more stable. Stephen is very talented in taking web designs from a designer and implementing them in a page with responsive design. In particular he has greatly refactored the Vsnap application's CSS to eliminate duplication and improve page load times."
      },
      {
        "name": "Guillaume Delloue",
        "title": "Director of Marketing, Vsnap, worked directly with Stephen at Vsnap",
        "content": "Stephen is a talented front-end developer with an immense appetite for learning and improving his skills. I can guarantee he'll be in the top 10% of the most productive developers in any organization. He's also a team player who's sensitive to the needs of other departments (marketing, sales, support etc.). Combined with his friendly demeanor and positive attitude Stephen is that rare dev talent any tech company would want to have. I highly recommend him."
      },
      {
        "name": "Christopher Swenor",
        "content": "It was amazing watch Stephen grow into what he is today. He started off as a Junior Developer and has grown into a developer that I can truly trust to make the right decisions. He has passion for JavaScript, and shows it in his work ethic. Vsnap is a better product because we found Stephen. He is extremely creative, and a pleasure to work with. I would do it again any chance I get.",
        "title": "CTO, Vsnap, managed Stephen at Vsnap"
      },
      {
        "name": "Brad Stevens",
        "content": "Stephen did a tremendous job detailing the essential components of the campaign's website and putting it together in a way that was visually stunning and easy to navigate. Stephen is great to work with and very responsive. I would highly recommend Stephen to any candidate, business or organization looking to make their digital mark.",
        "title": "worked directly with Stephen at Marilinda Garcia for Congress"
      }
    ]
  },
  "skills": {
    "title": "What I'm Great At",
    "tech": {
      "title": "Technologies/Languages/Frameworks",
      "content": [
        {"name": "Node", "favorite": true, "strong": true },
        {"name": "ReactJs", "favorite": true, "strong": true },
        {"name": "Redux", "favorite": false, "strong": true },
        {"name": "GraphQl", "favorite": true, "strong": true },
        {"name": "AWS", "favorite": false, "strong": false },
        {"name": "Docker", "favorite": true, "strong": false },
        {"name": "Keycloak", "favorite": false, "strong": false },
        {"name": "Auth0", "favorite": true, "strong": false },
        {"name": "Apollo", "favorite": false, "strong": false },
        {"name": "Flow", "favorite": false, "strong": false },
        {"name": "Webpack", "favorite": true, "strong": true },
        {"name": "Gulp", "favorite": false, "strong": false },
        {"name": "Storybook", "favorite": true, "strong": true },
        {"name": "NPM", "favorite": false, "strong": false },
        {"name": "MySql", "favorite": false, "strong": false },
        {"name": "Angular", "favorite": false, "strong": false },
        {"name": "jQuery", "favorite": false, "strong": false },
        {"name": "HTML5", "favorite": true, "strong": true },
        {"name": "CSS3", "favorite": true, "strong": true },
        {"name": "SCSS/LESS", "favorite": true, "strong": true },
        {"name": "Karma", "favorite": false, "strong": false },
        {"name": "Enzyme", "favorite": false, "strong": false }
      ]
    },
    "other": {
      "title": "Other things I've learned or used",
      "content": [
        {"name": "SEO", "favorite": true, "strong": false },
        {"name": "Site performance", "favorite": true, "strong": false },
        {"name": "A/B testing", "favorite": true, "strong": false },
        {"name": "Jest", "favorite": false, "strong": false },
        {"name": "Lambda", "favorite": false, "strong": false },
        {"name": "Git", "favorite": false, "strong": true },
        {"name": "Firebase", "favorite": false, "strong": false },
        {"name": "Tealium", "favorite": false, "strong": false },
        {"name": "GA", "favorite": false, "strong": false },
        {"name": "KISSmetrics", "favorite": false, "strong": false },
        {"name": "Optimizely", "favorite": false, "strong": false },
        {"name": "FileStack", "favorite": false, "strong": false },
        {"name": "Balsamiq", "favorite": false, "strong": false },
        {"name": "InvisionApp", "favorite": true, "strong": false },
        {"name": "Photoshop", "favorite": true, "strong": true },
        {"name": "Illustrator", "favorite": true, "strong": true },
        {"name": "Jira", "favorite": false, "strong": false },
        {"name": "Confluence", "favorite": false, "strong": false },
        {"name": "GtMetrix", "favorite": false, "strong": false }
      ]
    }
  },
  "gallery": {
    "title": "Me in my zone",
    "content": [
      { "src": "static/assets/bowling.jpg", "alt": "Me taking a turn at bowling" },
      { "src": "static/assets/woodworking.jpg", "alt": "Standing over a workbench using a biscuit joiner" },
      { "src": "static/assets/skiing.jpg", "alt": "A friend and I on a chairlift headed up Sugarloaf Mountain to ski." },
      { "src": "static/assets/painting-coop.jpg", "alt": "Painting a DIY Chicken Coop project" },
      { "src": "static/assets/planting-tree.jpg", "alt": "Planting apple trees with my son" },
      { "src": "static/assets/grass-close.jpg", "alt": "Up close photo of my lawn" },
      { "src": "static/assets/laying-pavers.jpg", "alt": "Making a paver entry way" },
      { "src": "static/assets/picking-potatoes.jpg", "alt": "Adding more soil to our potatoe mounds." },
      { "src": "static/assets/planting-grass.jpg", "alt": "Planting grass with my two kids" },
      { "src": "static/assets/radishes.jpg", "alt": "Fresh picked radishes from the garden" }
    ]
  },
  "highlight": {
    "title": "Employment Highlight",
    "header": "Paint Nite, LLC d/b/a Yaymaker, Somerville, MA — May 2015 - Feb 2020",
    "link": "https://www.yaymaker.com/",
    "logo": "static/assets/yaymaker-logo.svg",
    "roles": [
      "Senior Software Engineer — May 2016 - Feb 2020",
      "Software Engineer, Front End — May 2015 - May 2016"
    ],
    "focusHeader": "Focus",
    "focus": "React, Flow, Redux, Apollo, GraphQl, Storybook, Webpack, Enzyme, A/B testing, HTML, SCSS",
    "content": [
      {
        "title": "Rewrite of main web app from Java/AngularJS to NodeJS/ReactJS/GraphQL",
        "project": true,
        "content": [
          "Releasing <strong>incremental</strong> changes - page by page. This allowed for a safer and smoother transition",
          "<strong>Localized</strong> content for three separate locales",
          "More extensive Google Analytics tracking, powered through Tealium",
          "Executed an innovative search design which highlights both landscape and portrait paintings in a natural way",
          "Implemented “Quick-View” to allow users to see more details without leaving the page",
          "Added a “map-view” with custom pins and info windows",
          "Used a pinterest-style grid layout"
        ]
      },
      {
        "title": "Developed an in-house, server-side rendered, A/B Testing platform",
        "project": true,
        "content": [
          "No flicker or custom CSS needed",
          "Connected to Google Analytics Reporting",
          "<strong>$600k annualized lift</strong> with one of our first tests. (New filter design)"
        ]
      },
      {
        "title": "Created an ability to switch between Paint Nite and Plant Nite brands",
        "project": true,
        "content": [
          "Used/Created a shared Components <strong>NPM</strong> repo",
          "Custom copy, assets and styling"
        ]
      },
      {
        "title": "Worked with the Project Manager to define the development process, using Kanban as the core (and later Scrum)",
        "general": true,
        "content": [
          "Creating new ticket types",
          "Improved our swimlanes and meetings"
        ]
      },
      {
        "title": "Implemented Storybook to showcase our component library allowing developers and designers easy access for use.",
        "project": true,
        "content": [
          "Uses NPM",
          "4 separate apps use these components",
          "<strong class='alt' title='Well, at least at ONE point it was ;)'>100% code coverage</strong> with Jest and Enzyme"
        ]
      },
      {
        "title": "TODO: _Cross speciality learning_",
        "general": true,
        "content": [
          "Unblocked myself by picking up various server side work: <strong>GraphQl, Sequelize, and DB migrations</strong> for example. Which after a short while, I ended up being just as valuable as the rest of the team across all areas."
        ]
      },
      {
        "title": "Building the team",
        "general": true,
        "content": [
          "Helped with hiring, phone screens, interviews, code challenges, and resume reviews"
        ]
      },
      {
        "title": "Backstage Reskin (Our user facing admin application)",
        "project": true,
        "content": [
          "Latest react/apollo/flow - hooks",
          "Faster to spin out pages",
          "<strong>Ant Design</strong>"
        ]
      },
      {
        "title": "Brought unit testing to our client projects",
        "project": true,
        "content": [
          "Enzyme/Jest/Chai"
        ]
      },
      {
        "title": "Part of a large rebrand of the company",
        "project": true,
        "content": [
          "moving a codebase that was set up to work with two domains, with two brands, down to a single site with a different domain and brand than the originals."
        ]
      },
      {
        "title": "Dev Coop",
        "project": true,
        "content": [
          "Deployment slack integration and site/apis status",
          "Code Coverage on our js apps",
          "We had issues with deploying - most likely like everyone else",
          "Flask",
          "- Releases -",
          "JIRA, Bitbucket and Slack APIs",
          "Automatically grab upcoming releases, match them with jira tickets, link them to BB prs for merging",
          "Button clicks send messages and questions to slack channels that follows the steps to release - the app/bot needs approval (custom based on what is being released - matched devs with repos to pick who is needed for approval)",
          "Posts status updates during deployment",
          "Posts next deployment plans and steps",
          "Provides an <strong>automatic rollback plan</strong>",
          "Lists of releases, statuses, steps",
          "View previous releases"
        ]
      },
      {
        "title": "Mandrill Email App(s)",
        "project": true,
        "content": [
          "Before we had zero source control and only disorganized and often broken html files",
          "Gulp / Flask (Python) / Mandrill API",
          "Ability to spin up emails visible on all clients very quickly",
          "Shared partial files like headers, footers, images",
          "Imported the styleguide from the main website via npm",
          "Template previewer with mock data (vs random templating strings)",
          "Keycloak with roles and then later, <strong>Auth0</strong>",
          "Source control",
          "Deployable with docker, hosted app that allows developers and QA to view and test with custom variables on any environment. Ability to publish a draft or live on any env. develop/staging/prod",
          "Integrated with deployments which was now safer and easier - with the ability to roll back changes if needed."
        ]
      },
      {
        "title": "Analytics",
        "project": true,
        "content": [
          "shared library",
          "unit tested",
          "Graphql partials ensured all data needed was retrieved",
          "Shared among many apps",
          "Great configuration makes it simple to update how the data is transposed"
        ]
      },
      {
        "title": "Elastic Search",
        "project": true,
        "content": [
          "Brought more use to our search page",
          "<strong>Fuzzy matching and autocomplete</strong>. Able to search against many different resource types",
          "Setup tools for the team to easily update/copy/remove/etc our indices and migrate data up/down environments",
          "Worked to replace Google Maps Places API with in-house ES version which <strong>decreased API costs by approximately $87,000 yearly</strong>"
        ]
      },
      {
        "title": "SEO",
        "project": true,
        "content": [
          "Site cleanup with easier quick fixes like <strong>meta tags, alt tags, Hx’s</strong>, etc.",
          "Generated sitemap since our events were ephemeral",
          "Created a <strong>shared URLs package</strong> with graphql partials that ensure our urls were always canonical, and this was shared amongst many clients",
          "Middleware for inactive landing pages (artists, events, etc..) so that we could properly redirect <strong>(avoiding 404)</strong>",
          "Screaming Frog: Minimized redirects / Identified broken links / Identified use of Hx’S / Robots.txt / Identified missing meta tags - built a component to handle this dynamically. Used NPM package to handle UGC links rel=”ugc nofollow”"
        ]
      },
      {
        "title": "Site Performance",
        "project": true,
        "content": [
          "Image size / Image rendering tool",
          "Alt tags / Needed sizes / Optimized all the images on our site with manual insert / Project images, venues, host, and could be used for heroes, logs, etc.",
          "<strong>Code Splitting</strong>",
          "Critical CSS",
          "HTTP Requests",
          "<strong>S3/Cloudfront caching</strong>",
          "GtMetrix",
          "Lambda function to assist with SEO objectives / Minifying / Self-hosting / Slack integration / 3rd party vendor scripts",
          "Audit of code for bundle bloat / Webpack / Removing duplicate or bloated node modules",
          "Nightwatch E2E tests"
        ]
      }
    ]
  },
  "conclusion": {
    "title": "Conclusion",
    "content": [
      "<span>stephen@thewickedweb.dev <small>Southern NH</small> - Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea <a href=\"https://blog.thewickedweb.dev/?p=33\">link to blog post</a>. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.</span>",
      "<span>stephen@thewickedweb.dev <small>Southern NH</small> - Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea <a href=\"https://blog.thewickedweb.dev/?p=33\">link to blog post</a>. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.</span>"
    ]
  }
}
